//https://www.acmicpc.net/problem/9935

// 빌보는 자신의 인생의 사랑, 오블리브를 만나지만, 그녀는 섬뜩할 정도로 친숙해 보이고, 그는 그들이 친척일까봐 걱정합니다. 
//둘 다 자신의 조상을 알고 있지만, 빌보는 남성적 형태로 조상의 이름을 알고 있고, 
//오블리브는 여성적 형태로 조상의 이름을 알고 있기 때문에 그들의 조상 가계도를 비교할 수 없습니다. 
//두 형태는 관련이 없습니다. 그들이 형제 자매라 하더라도, 그들이 알고 있는 조상의 이름은 모두 다를 것입니다!
// 빌보와 오블리브는 그들의 가계도를 작성했습니다. 
//여러분의 과제는 두 나무가 동형인지, 즉 두 나무 사이에 일대일 매핑이 있는지를 판단하는 것입니다. 
//이름은 무시합니다. 나무가 뿌리를 내렸다고 가정합니다. 즉, 뿌리가 고정되어 있다고 가정합니다. 
//예를 들어, 아래 왼쪽의 두 나무는 서로 동형이 아닙니다. 
//a의 두 자식을 x의 두 자식에 매핑할 방법이 없습니다. 
//a의 한 자식은 두 자식을 가져야 하지만 x의 자식은 그렇지 않기 때문입니다.
//반면, 오른쪽의 두 트리는 동형입니다. 매핑은 다음과 같습니다. 
//a ↔ x(루트는 항상 서로 매핑되어야 함), 
//b ↔ z, c ↔ y, g ↔ u, d ↔ w, e ↔ t, f ↔ v. 또 다른 동형이 하나 있습니다(d와 e의 매핑을 바꿈).

//입력
//테스트 데이터 파일의 첫 번째 줄에는 테스트 케이스의 수(< 100)가 포함됩니다. 
//이러한 각 테스트 케이스에는 트리를 설명하는 두 줄이 있습니다. 
//입력 줄은 루트에서 시작하여 사전 순서 순회에서 발견된 노드 레이블을 나열하여 트리를 설명합니다. 
//즉, 트리는 루트에서 리프로, 왼쪽에서 오른쪽으로 순회하며, 그 과정에서 모든 노드의 레이블이 출력됩니다. 
//각 자식 집합 뒤에 해시 표시('#')가 있습니다. 모든 노드 레이블과 해시 표시는 공백으로 구분됩니다. 
//아래 예는 위의 두 예에 대한 사전 순서 순회를 보여줍니다.
// 2
// a b d # e # # c # #
// x y u # # z # #
// a b d # e # # c f # # g # #
// x y v # # u # z w # t # # #

//출력
// The two trees are not isomorphic.
// The two trees are isomorphic.
